In [1]:
import pandas as pd

In [2]:
cast=pd.read_csv('cast.csv')
#titles=pd.read_csv('titles.csv')
titles = pd.read_csv('titles.csv', index_col=None)

In [3]:
cast.head()

                               title  year       name   type character     n
0                    Suuri illusioni  1985     Homo $  actor    Guests  22.0
1     Gangsta Rap: The Glockumentary  2007  Too $hort  actor   Himself   NaN
2                  Menace II Society  1993  Too $hort  actor   Lew-Loc  27.0
3  Porndogs: The Adventures of Sadie  2009  Too $hort  actor     Bosco   3.0
4                 Stop Pepper Palmer  2014  Too $hort  actor   Himself   NaN

In [4]:
cast.year.dtype

dtype('int64')

In [5]:
titles.head()

                     title  year
0           The Rising Son  1990
1        Ashes of Kukulcan  2016
2  The Thousand Plane Raid  1969
3         Crucea de piatra  1993
4                   The 86  2015

# question 1

In [6]:
#(titles=='Hamlet').count

len(titles[titles.title == 'Hamlet'])

#(titles[titles.title == 'Hamlet']).count
#titles[titles.year==1969]

19

In [7]:
cast.columns

Index(['title', 'year', 'name', 'type', 'character', 'n'], dtype='object')

In [8]:
cast.index

RangeIndex(start=0, stop=3333695, step=1)

In [9]:
#cast.info

In [10]:
#cast.title['Suuri illusioni'].value_counts()

In [11]:
#cast.title.sort_values()['Treasure Island']

In [12]:
#cast.title.loc['Hamlet']

# question 2

In [13]:
titles[titles.title == 'Treasure Island'].sort_values('year')

#titles[titles.title == 'Treasure Island'].sort('year')

                  title  year
191379  Treasure Island  1918
47769   Treasure Island  1920
192917  Treasure Island  1934
90175   Treasure Island  1950
104714  Treasure Island  1972
103646  Treasure Island  1973
190792  Treasure Island  1985
166675  Treasure Island  1999

question 3

In [14]:
#cast[(cast['title']=='Hamlet') & (cast['year']== 1920)]

In [15]:
len(cast[(cast.title == 'Hamlet') & (cast.year == 1921)])

9

In [16]:
#cust[(cust['profession']=='Structural Engineer') & (cust['gender']== 'Male') ].count()

question 4

In [17]:
# gb=cast.groupby(by='year')
cast[cast["title"]=="Hamlet"]["year"].groupby((cast["year"]//10)*10).count()

year
1910    28
1920     9
1940    25
1950     1
1960    57
1970    19
1980     3
1990    84
2000    55
2010    18
Name: year, dtype: int64

In [18]:
cast[(cast["n"]==1)&(cast["year"]>1949)&(cast["year"]<1960)]["n"].count()

9201

# question 5

In [19]:
len(cast[(cast.type == 'actor') & (cast.n==1) &  (cast.year >= 1950) & (cast.year < 1960)]) # in the 1950s

6388

In [20]:
#len(cast[(cast.type == 'actress') &  (cast.year >= 1950) & (cast.year < 1960)])

In [21]:
# cast.groupby('name').name.value_counts().head(10)

In [22]:
# name

In [23]:
# cast[ (cast.n==1) &  (cast.year >= 1990) ].name.value_counts().head(10)

In [24]:
# cast[ (cast.name=='Frank Oz') &  (cast.character.value_counts()>1) ]

In [25]:
# cast[(cast.character.value_counts()>1) & (cast.name=='Frank Oz')]

# Question 6

In [26]:
cast[["name","n"]][cast["n"]==1].groupby("name").count().sort_values("n",ascending=False).head(10)

                     n
name
Charles Starrett   200
Mohanlal           184
Mammootty          177
Buck Jones         130
Rajesh Khanna      127
Johnny Mack Brown  124
John Wayne         117
Amitabh Bachchan   113
Bob Steele         110
Dharmendra         107

# Question 7

In [27]:
group=cast[cast["name"]=="Frank Oz"].groupby(["year","title"]).agg({"n":"count"})
group[group["n"]>1]

                                               n
year title
1979 The Muppet Movie                          8
1981 An American Werewolf in London            2
     The Great Muppet Caper                    6
1982 The Dark Crystal                          2
1984 The Muppets Take Manhattan                7
1985 Sesame Street Presents: Follow that Bird  3
1992 The Muppet Christmas Carol                7
1996 Muppet Treasure Island                    4
1999 Muppets from Space                        4
     The Adventures of Elmo in Grouchland      3